stress-test/artillery.yml
config:
  target: "{{ $processEnvironment.PREVIEW_URL }}"
  http:
    timeout: 15
  defaults:
    headers:
      Authorization: "Bearer {{ $processEnvironment.TEST_JWT }}"
  phases:
    - name: "Warm-up"
      duration: 30
      arrivalRate: 2
    - name: "Ramp-up"
      duration: 60
      arrivalRate: 2
      rampTo: 25
    - name: "Peak"
      duration: 60
      arrivalRate: 25
    - name: "Spike"
      duration: 20
      arrivalRate: 60
  plugins:
    expect: {}

scenarios:
  # Scenario 1: Double-booking — all users try to book the same slot simultaneously
  - name: "Double-booking - concurrent reservation creates"
    weight: 40
    flow:
      - post:
          url: "/api/reservations?action=create"
          json:
            customer_name: "StressTest DoubleBook"
            customer_phone: "+5511999887700"
            party_size: 4
            date: "2026-04-01"
            time: "20:00"
          expect:
            - statusCode:
                - 200
                - 409  # 409 = slot taken, is acceptable
                - 429  # rate limiter for reservations is 20/hr

  # Scenario 2: Rate limit burst — analytics endpoint hammered to trigger 429s
  - name: "Rate limit - analytics burst"
    weight: 30
    flow:
      - get:
          url: "/api/analytics?period=today"
          expect:
            - statusCode:
                - 200
                - 402  # Payment required
                - 403  # Plan gating (test restaurant may not have analytics)
                - 429  # Expected once threshold is hit
      - get:
          url: "/api/analytics?period=7d"
          expect:
            - statusCode:
                - 200
                - 402
                - 429

  # Scenario 3: DB connection load — mixed concurrent reads simulating peak dinner service
  - name: "DB load - mixed dashboard reads"
    weight: 30
    flow:
      - get:
          url: "/api/host-dashboard?action=dashboard"
          expect:
            - statusCode:
                - 200
                - 429
      - get:
          url: "/api/waitlist"
          expect:
            - statusCode:
                - 200
                - 429
      - get:
          url: "/api/analytics?period=today"
          expect:
            - statusCode:
                - 200
                - 402
                - 429